*&---------------------------------------------------------------------*
*& Include          YCL120_001_PBO
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Module STATUS_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE status_0100 OUTPUT.
  SET PF-STATUS 'S0100'.
  SET TITLEBAR 'T0100'.
ENDMODULE.
*&---------------------------------------------------------------------*
*& Module INIT_ALV_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE init_alv_0100 OUTPUT.

*IF GR_CON IS INITIAL. "변수가 초기 상태인가?
  "초기상태이미르 생성과정
*ELSE.
  "이미 만들어진 상태이므로 새로고침 로직
*ENDIF.

  IF gr_con IS BOUND.    "참조 변수에 연결된 객체가 있는가?
    "이미 만들어진 상태이므로 새로고침 로직
  ELSE.
    "초기상태 이므로 생성과정
    PERFORM create_object_0100. "Container, ALV 참고 변수 생성
    PERFORM set_alv_layout_0100.
    PERFORM set_alv_fieldcat_0100.
    PERFORM display_alv_0100.
  ENDIF.

ENDMODULE.
